app/Models/UserModel.php

    public function verify_petugas($username, $password){
        $db = \Config\Database::connect();
        $builder = $db->table('petugas');
        $builder->select('*');
        $builder->where('level', 'petugas');
        $builder->where('Username', $username);
        $builder->where('Password', $password);
        $query = $builder->get();
---
SELECT *
FROM `petugas`
WHERE `level` = 'petugas'
AND `Username` = 'tfsid'
AND `Password` = '$2y$10$JxOWE84jWkMkkm6a6EMqDe3/r'

    public function verify_user($username, $password, $table) {
        $db = \Config\Database::connect();
        $builder = $db->table('masyarakat');
        $builder->select('*');
        $builder->where('Username', $username);
        $builder->where('Password', $password);
        $query = $builder->get();
---
SELECT *
FROM `masyarakat`
WHERE `Username` = 'tfsid'
AND `Password` = '$2y$10$JxOWE84jWkMkkm6a6EMqDe3/r'